package homework;

public class HW6 {
    public static void main(String[] args) {
        /**1. Распечатать последовательность чисел от 0 до 9 включительно.*/
        /**2. Распечатать последовательность чисел от 10 исключительно до 0 включительно.*/
        /**3. Распечатать последовательность чисел от 50 до 55 включительно с шагом 2.*/
        /**4. Распечатать последовательность чисел, кратных 7, в промежутке (327, 300)*/
        /**5. Распечатать последовательность чисел в промежутке [12, 13] с шагом 0.1*/
        /**6. Распечатать последовательность четных чисел от 215 до 237 включительно*/
        /**7. Распечатать последовательность чисел, кратных 7, в промежутке от 7 исключительно до 14 исключительно.*/
        /**8. Распечатать последовательность которая начинается с минимального значения типа данных short и
         * заканчивается максимальным значением short. Числа в последовательности должны быть кратны 15001.
         */

        /**9. Распечатать последовательность чисел в промежутке от -10 до 34 включительно. Числа, кратные 11,
         * должны быть распечатаны синим цветом. Числа, кратные 12, должны быть распечатаны красным цветом.
         *     А ноль необходимо распечатать словом ZERO.
         */

        /**10. Написать метод, который принимает на вход параметры start,  end, step,
         * и печатает последовательность десятичных  чисел, начиная с числа start, с шагом step.
         *     Точка выхода из цикла - число end.
         */


        /**11. Написать метод, который принимает параметр  l и печатает  последовательность четных чисел от нуля.
         * Длина последовательности = L.
         */

        /**12. Напишите метод, который принимает целое число n, и выводит все степени числа 2 от 1 до n включительно*/
        /**13. Вывести последовательность 012345678900112233445566778899000…  до числа 9999 включительно.*/
        /**14.  Распечатайте последовательность чисел:
         0, 1, -1, 2, -2, 3, -3, 4, -4, 5, -5*/
        /**15. Распечатать последовательность чисел:
         0, 3, 5, 6, 9, 10, 12, 15, 18, 20, 21, 24, 25*/
        /**16. Написать метод, который принимает параметры n, m, , и печатает последовательность нечетных чисел
         * начиная с числа n, с шагом m,  длина последовательности  .
         */

        /**17.  Сгенерируйте и распечатайте последовательность по формуле:
         n + 1 = n + 2*/
        /**18. Написать метод, который принимает параметры , n, и печатает последовательность чисел, начиная с числа n,
         * по формуле для n + 1 члена последовательности:
         *      n + 1 = 2n
         *      Длина последовательности  .
         */

        /**19.  Сгенерируйте последовательность целых положительных  двузначных чисел,
         * в которых разница между первой цифрой (десятки) и второй цифрой (единицы) не превышает 3.
         */

        /**20.  Написать метод, который вычислит значение функции: */
    }
}

