package homework;

public class HW7 {
    /** 1. Создать массив catsNames, заполнить его любыми значениями (см картинку котов из презентации).*/

    /** 2. В массиве catsNames изменить значение элемента с индексом 4 на “Рыжик”,
     * а значение элемента с индексом 1 на “Черныш”.
      */

     /** 3. Создать массив catsColors и заполнить его значениями.*/
     /** 4. Создать массив catsAges и заполнить его любыми значениями.*/
     /** 5. Создать массив isCatRed и заполнить его соответствующими значениями*/
     /** 6. Распечатать для массивов catsNames и catsColors:
     a. имя кота в коробке с номером 6
     b. имена котов из коробок с четными индексами
     c. имена котов из коробок, чьи индексы кратны 4
     d. цвет котов из коробок с нечетными индексами
     e. цвет котов из коробок, чьи индексы кратны 3*/
     /** 7. Распечатать “Накорми кота!” для всех серых котов*/
     /** 8. Распечатать “Отнеси кота на прививку!”, если возраст кота меньше 2 лет*/
     /** 9. Для кота в последней коробке распечатать имя, цвет, возраст*/
     /** 10. Распечатать имена всех котов, чей возраст больше 2 лет*/
     /** 11.  Распечатать “Накорми кота!” если имя кота “Рыжик” и значение isCatRed == true*/


     /** 12. Распечатать средний возраст котов из массива catsAges*/
     /** 13. Распечатать возраст самого молодого кота*/
     /** 14. Распечатать возраст самого старого кота*/
     /** 15. Распечатать количество серых котов*/
     /** 16. Распечатать имя кота, если кот находится в коробке с четным индексом и его возраст не больше 3 лет*/
     /** 17. Создать массив четных положительных чисел, значения которых не больше 10.
     (заполняем значения с помощью цикла for)*/
     /** 18. Написать метод, который принимает на вход массив int, и возвращает среднее значение.
     Проверить работу метода тестом, если параметр - массив catsAges*/
     /** 19. Создать массив нечетных отрицательных чисел в промежутке от -1000 до -900*/
     /** 20. Создать массив из 10 случайных положительных целых чисел*/



     /** 21. Создать метод, который принимает на вход массив int,  и возвращает минимальное значение,
     максимальное значение и среднее значение всех чисел массива. Проверить работу метода на массиве из задания 20.*/
     /** 22. Создать массив четных чисел и массив нечетных чисел из элементов массива из задания 20.*/
     /** 23. Создать двумерный массив, который состоит из имен, возрастов, цветов котов:
            Распечатать все данные котов в коробках с четными индексами, используя двумерный массив.*/
     /** 24. Создать двумерный массив целых случайных чисел от 1 до 10 размерности 4*8.*/
     /** 25. Вывести сумму всех четных чисел массива из задания 24.*/

     }
